app/controllers/snort_event_collectors_controller.rb

  def create
    @snort_event_collector = SnortEventCollector.new(snort_event_collector_params)

    if @snort_event_collector.save
---
INSERT INTO `snort_event_collectors` (`cid`, `dst_ip`, `dst_port`, `ip_csum`, `ip_flags`, `ip_hlen`, `ip_id`, `ip_len`, `ip_off`, `ip_proto`, `ip_tos`, `ip_ttl`, `ip_ver`, `priority`, `sid`, `signature`, `signature_gen`, `signature_id`, `signature_rev`, `src_ip`, `src_port`, `status`, `timestamp`, `unified_event_id`, `unified_event_ref`, `unified_ref_time`, `created_at`, `updated_at`) VALUES (1391, 167772687, 123, 55333, 0, 5, 39445, 76, 0, 17, 0, 64, 4, 2, 3, 'ET TOR Known Tor Relay/Router (Not Exit) Node UDP Traffic group 184', 1, 2522367, 2979, 2812302519, 123, 0, '2017-06-02 01:43:00', 353, 353, '2017-06-02 01:43:00', '2017-06-02 23:05:20', '2017-06-02 23:05:20')